import model.GameModel;

public class Main {

    public static void main(String[] args) {
        // створюємо об'єкт класу з логікою гри
        // 1 агрумент конструктора це рядок, який буде відображатись в заголовку вікна
        // 2 аргумент конструктора це булева константа, якою визначає чи буде вікно з рамками
        // 3 аргумент конструктора це цілочисельна константа яка визначає колір фону (в даному випадку: чорний)
        GameModel gameModel = new GameModel("TANKS", true, 0xff000000);
        // запускаємо "ігровий" цикл
        gameModel.run();
        // якщо "ігровий" цикл більше не буде виконуватись, то вікно зникне звільнивши всі ресурси, що воно використовує
        // і після цього програма завершить свою роботу
    }
}
